# ============================================================
# ระบบแนะนำวิชาเสรี
#
# Input
#   1. สาขา
#   2. ภาคการศึกษา (1 / 2)
#   3. Keyword 3 คำ
#
# เงื่อนไข

#   - วิชาเสรีต้องอยู่ในภาคการศึกษาที่เลือก

#   - ไม่ชนตารางเรียนวิชาบังคับ

#   - ไม่ชนสอบกลางภาคของวิชาบังคับ

#   - ไม่ชนสอบปลายภาคของวิชาบังคับ

#

# วิธีประมวลผล

#   - TF-IDF

#   - Cosine Similarity

#   - Item-Based Collaborative Filtering

#

# Output

#   - วิชาเสรีที่เหมาะสม เรียงตามคะแนน

# ============================================================


import numpy as np
import pandas as pd
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity


# ============================================================

# 1. ข้อมูลวิชาบังคับ

#    โครงสร้าง:

#

#    สาขา

#       └── เทอม

#             └── รหัสวิชา

# ============================================================

MANDATORY_COURSES = {

    # ========================================================

    # คณิตศาสตร์ประยุกต์

    # ========================================================

    "คณิตศาสตร์": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511101": {

            "name": "แคลคูลัส 1",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            
            "514107": {

            "name": "ฟิสิกส์พื้นฐาน",
            "classes": [
                ("อังคาร", "08:30", "10:15"),
                ("พฤหัสบดี", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-10",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-27",
                "13:30",
                "16:30"
                )
            },
            
            "514108": {

            "name": "ปฎิบัติการฟิสิกส์พื้นฐาน",
            "classes": [
                ("พฤหัสบดี", "13:00", "15:40")
            ],
            "midterm": None
            ,
            "final": (
                "2568-10-28",
                "09:00",
                "11:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511102": {

                "name": "แคลคูลัส 2",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-28",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-25",
                    "09:00",
                    "12:00"

                )

            },
            
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "13:00", "14:45"),
                    ("พฤหัสบดี", "13:00", "13:50")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-30",
                    "13:30",
                    "16:30"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("ศุกร์", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-30",
                    "09:00",
                    "11:00"

                )

            },
            "517111": {

                "name": "การเขียนโปรแกรมคอมพืวเตอร์สำหรับนักวิทยาการข้อมูล",
                "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("พุธ", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"

                )

            }

        }

    },


    # ========================================================

    # วิทยาการข้อมูล

    # ========================================================

    "ชีววิทยา": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511106": {

            "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 1",
            "classes": [
                ("จันทร์", "12:10", "13:50"),
                ("อังคาร", "13:00", "14:45")
            ],
            "midterm": (
                "2568-09-07",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("พุธ", "09:25", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พฤหัสบดี", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("ศุกร์", "10:20", "11:10")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("ศุกร์", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )

            },
            
            "514107": {

            "name": "ฟิสิกส์พื้นฐาน",
            "classes": [
                ("อังคาร", "08:30", "10:15"),
                ("พฤหัสบดี", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-10",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-27",
                "13:30",
                "16:30"
                )
            },
            
            "514108": {

            "name": "ปฎิบัติการฟิสิกส์พื้นฐาน",
            "classes": [
                ("พฤหัสบดี", "09:25", "12:05")
            ],
            "midterm": None
            ,
            "final": (
                "2568-10-28",
                "09:00",
                "11:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511107": {

                "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 2",
                "classes": [
                    ("อังคาร", "10:20", "12:05"),
                    ("พฤหัสบดี", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-25",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-25",
                    "13:30",
                    "16:30"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "512103": {

                "name": "ชีวิตและความหลากหลาย",
                "classes": [
                    ("จันทร์", "13:00", "13:50"),
                    ("พุธ", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-30",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-26",
                    "09:00",
                    "12:00"

                )

            },
            "512104": {

                "name": "ปฎิบัติการชีวิตและความหลากหลาย",
                "classes": [
                    ("พฤหัสบดี", "13:55", "16:35")
                ],

                "midterm": (
                    "2569-01-30",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2027-03-26",
                    "13:30",
                    "16:30"

                )

            },
            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "513104": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("พุธ", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"

                )

            }

        }

    },
    
    "เคมี": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511101": {

            "name": "แคลคูลัส 1",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พุธ", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "11:15", "12:05")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พฤหัสบดี", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )

            },
            
            "513161": {

            "name": "เปิดโลกเคมี",
            "classes": [
                ("พฤหัสบดี", "08:30", "10:15")
            ],
            "midterm": None
            ,
            "final": None
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511102": {

                "name": "แคลคูลัส 2",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-28",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-25",
                    "09:00",
                    "12:00"
                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "513104": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("อังคาร", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"
                )

            },
             "514107": {

            "name": "ฟิสิกส์พื้นฐาน",
            "classes": [
                ("พุธ", "13:00", "14:45"),
                ("ศุกร์", "13:00", "14:45")
            ],
            "midterm": (
                "2569-02-01",
                "09:00",
                "12:00"

            ),
            "final": (
                "2569-03-24",
                "13:30",
                "16:30"
                )
            },
            
            "514108": {

            "name": "ปฎิบัติการฟิสิกส์พื้นฐาน",
            "classes": [
                ("จันทร์", "13:00", "15:40")
            ],
            "midterm": None
            ,
            "final": (
                "2569-03-26",
                "09:00",
                "11:00"
                )

            }

        }

    },
    "ฟิสิกส์": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511101": {

            "name": "แคลคูลัส 1",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พุธ", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("ศุกร์", "10:20", "11:10")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"
                )

            },
            
            "514101": {

            "name": "ฟิสิกส์ทั่วไป 1",
            "classes": [
                ("พุธ", "08:30", "10:15"),
                ("ศุกร์", "11:15", "12:05")
            ],
            "midterm": (
                "2568-09-10",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-27",
                "09:00",
                "12:00"
                )
            },
            
            "514103": {

            "name": "ปฎิบัติการฟิสิกส์ทั่วไป 1",
            "classes": [
                ("ศุกร์", "13:00", "15:40")
            ],
            "midterm": None
            ,
            "final": (
                "2568-10-28",
                "09:00",
                "11:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511102": {

                "name": "แคลคูลัส 2",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-28",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-25",
                    "09:00",
                    "12:00"
                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("พุธ", "10:20", "12:05"),
                    ("ศุกร์", "13:00", "13:50")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "513104": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("อังคาร", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"
                )

            },
             "514102": {

            "name": "ฟิสิกส์ทั่วไป 2",
            "classes": [
                ("พฤหัสบดี", "08:30", "10:15"),
                ("ศุกร์", "09:25", "10:15")
            ],
            "midterm": (
                "2569-01-24",
                "09:00",
                "12:00"

            ),
            "final": (
                "2569-03-27",
                "13:30",
                "16:30"
                )
            },
            
            "514104": {

            "name": "ปฎิบัติการฟิสิกส์ทั่วไป 2",
            "classes": [
                ("จันทร์", "09:25", "12:05")
            ],
            "midterm": None
            ,
            "final": (
                "2569-03-26",
                "09:00",
                "11:00"
                )

            },
            
            "514161": {

            "name": "คอมพิวเตอร์เบื้องต้นสำหรับนักฟิสิกส์",
            "classes": [
                ("อังคาร", "08:30", "10:15"),
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": (
                "2569-01-29",
                "13:00",
                "16:00"
                )
            ,
            "final": None

            }

        }

    },
    "สถิติและวิทยาการวิเคราะห์ข้อมูล": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511110": {

            "name": "แคลคูลัสสำหรับการวิเคราะห์ช้อมูล 1",
            "classes": [
                ("จันทร์", "14:50", "16:35"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512108": {

            "name": "ชีววิทยาสำหรับวิทยาศาสตร์ประยุกต์",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "515101": {

            "name": "การคิดเชิงสถิติ",
            "classes": [
                ("พฤหัสบดี", "13:00", "16:35")
            ],
            "midterm": (
                "2568-09-07",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-30",
                "09:00",
                "12:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511111": {

                "name": "แคลคูลัสสำหรับการวิเคราะห์ข้อมูล 2",
                "classes": [
                    ("จันทร์", "08:30", "10:15"),
                    ("พุธ", "14:45", "16:35")
                ],

                "midterm": (
                    "2569-01-25",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-23",
                    "09:00",
                    "12:00"
                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "515202": {

                "name": "หลักสถิติ",
                "classes": [
                    ("จันทร์", "13:00", "14:45"),
                    ("อังคาร", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-30",
                    "09:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-26",
                    "09:00",
                    "15:30"

                )

            },
            "517111": {

                "name": "การเขียนโปรแกรมคอมพืวเตอร์สำหรับนักวิทยาการข้อมูล",
                "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("พฤหัสบดี", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"
                )

            }

        }

    },
    "วิทยาศาสตร์สิ่งแวดล้อม": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511106": {

            "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 1",
            "classes": [
                ("จันทร์", "12:10", "13:50"),
                ("อังคาร", "13:00", "14:45")
            ],
            "midterm": (
                "2568-09-07",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("พุธ", "09:25", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("ศุกร์", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "11:15", "12:05")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พฤหัสบดี", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511107": {

                "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 2",
                "classes": [
                    ("อังคาร", "10:20", "12:05"),
                    ("พฤหัสบดี", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-25",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-25",
                    "13:30",
                    "16:30"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "512103": {

                "name": "ชีวิตและความหลากหลาย",
                "classes": [
                    ("จันทร์", "13:00", "13:50"),
                    ("พุธ", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-30",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-26",
                    "09:00",
                    "12:00"

                )

            },
            "512104": {

                "name": "ปฎิบัติการชีวิตและความหลากหลาย",
                "classes": [
                    ("พฤหัสบดี", "13:55", "16:35")
                ],

                "midterm": (
                    "2569-01-30",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2027-03-26",
                    "13:30",
                    "16:30"

                )

            },
            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "513104": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("พุธ", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"

                )

            }

        }

    },
    "วิทยาการคอมพิวเตอร์": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511100": {

            "name": "ความรู้พื้นฐานสำหรับแคลคูลัส",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("ศุกร์", "10:20", "12:05"),
                ("พุธ", "16:40", "18:25")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-11-02",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },
            "SU301": {

            "name": "พลเมืองตื่นรู้",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": (
                "2568-08-30",
                "17:00",
                "19:00"
                ),
            "final": None
            },

           "511108": {

            "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์คณนา 1",
            "classes": [
                ("จันทร์", "13:00", "14:45"),
                ("ศุกร์", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"
                )
            },
            "517101": {

            "name": "ความรอบรู้และความเป็นพลเมืองดิจิทัล",
            "classes": [
                ("พุธ", "08:30", "12:05")
            ],
            "midterm": (
                "2568-09-07",
                "08:30",
                "12:30"

            ),
            "final": (
                "2568-10-22",
                "08:30",
                "12:30"
                )
            },
            "517121": {

                "name": "ทักษะการเขียนโปรแกรมคอมพิวเตอร์ 1",
                "classes": [
                    ("จันทร์", "09:25", "12:05"),
                    ("อังคาร", "13:00", "14:45"),
                    ("พฤหัสบดี", "13:00", "14:45"),
                    ("ศุกร์", "16:40", "18:25")
                ],

                "midterm": (
                    "2568-09-08",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2568-10-28",
                    "09:00",
                    "17:30"

                )

           }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "515104": {

                "name": "สถิติสำหรับคอมพิวเตอร์",
                "classes": [
                    ("จันทร์", "14:50", "16:35"),
                    ("อังคาร", "13:00", "14:45")
                ],

                "midterm": (
                    "2569-01-27",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "16:30"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "SU203": {

            "name": "ทักษะการสื่อสารอย่างสร้างสรรค์",
            "classes": [
                ("พุธ", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            "517112": {

                "name": "การออกแบบวงจรตรรกะเชิงเลข",
                "classes": [
                    ("พุธ", "12:10", "14:45")
                ],

                "midterm": None ,
                "final": (
                    "2569-03-26",
                    "13:30",
                    "16:30"

                )

            },
            "517122": {

                "name": "ทักษะการเขียนโปรแกรมคอมพิวเตอร์ 2",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "08:30", "10:15"),
                    ("อังคาร", "14:50", "18:25")
                ],

                "midterm": (
                    "2569-01-30",
                    "13:00",
                    "17:00"
                ),
                "final": (
                    "2027-03-25",
                    "09:00",
                    "17:30"

                )

            
            }

        }

    },
    "จุลชีววิทยา": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511114": {

            "name": "คณิตศาสตร์ทั่วไป",
            "classes": [
                ("จันทร์", "13:55", "15:40"),
                ("อังคาร", "13:00", "14:45"),
                ("จันทร์", "15:45", "16:35")
            ],
            "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("ศุกร์", "09:25", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พุธ", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("ศุกร์", "10:20", "11:10 ")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พฤหัสบดี", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "513102": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("พฤหัสบดี", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"


                )

            },
            "514107": {

            "name": "ฟิสิกส์พื้นฐาน",
            "classes": [
                ("พุธ", "13:00", "14:45"),
                ("ศุกร์", "13:00", "14:45")
            ],
            "midterm": (
                "2569-02-01",
                "09:00",
                "12:00"

            ),
            "final": (
                "2569-03-24",
                "13:30",
                "16:30"
                )
            },
            
            "514108": {

            "name": "ปฎิบัติการฟิสิกส์พื้นฐาน",
            "classes": [
                ("จันทร์", "13:00", "15:40")
            ],
            "midterm": None
            ,
            "final": (
                "2569-03-26",
                "09:00",
                "11:00"
                )

            },
            "518101": {

                "name": "จุลชีววิทยาทั่วไป",
                "classes": [
                    ("จันทร์", "09:25", "12:05")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "12:00"

                )

            },
            "518102": {

                "name": "ปฎิบัติการจุลชีววิทยาทั่วไป",
                "classes": [
                    ("อังคาร", "13:00", "15:40"),
                    ("พุธ", "14:50", "15:40")
                ],

                "midterm": (
                    "2569-01-31",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-27",
                    "13:30",
                    "16:30"

                )
            }

        }

    },
    "คณิตศาสตร์ประยุกต์": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511101": {

            "name": "แคลคูลัส 1",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"


                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512108": {

            "name": "ชีววิทยาสำหรับวิทยาศาสตร์ประยุกต์",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "519161": {

            "name": "คณิตศาสตร์เชิงธุรกิจและการวิเคราะห์",
            "classes": [
                ("อังคาร", "08:30", "10:15"),
                ("พฤหัสบดี", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-11",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-30",
                "09:00",
                "12:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511102": {

                "name": "แคลคูลัส 2",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-28",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-25",
                    "09:00",
                    "12:00"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "514231": {

                "name": "ข้อมูลฟิสิกส์สำหรับนักวิทยาศาสตร์",
                "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("พฤหัสบดี", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-27",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-31",
                    "09:00",
                    "12:00"


                )

            },
            "515202": {

                "name": "หลักสถิติ",
                "classes": [
                    ("จันทร์", "13:00", "14:45"),
                    ("อังคาร", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-30",
                    "09:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-26",
                    "09:00",
                    "15:30"
                )
            },
            
            "517111": {

                "name": "การเขียนโปรแกรมคอมพืวเตอร์สำหรับนักวิทยาการข้อมูล",
                "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"
                )

            }

        }

    },
    "เทคโนโลยีสารสนเทศ": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511100": {

            "name": "ความรู้พื้นฐานสำหรับแคลคูลัส",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("ศุกร์", "10:20", "12:05"),
                ("พุธ", "16:40", "18:25")
            ],
            "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-11-02",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },
            "SU301": {

            "name": "พลเมืองตื่นรู้",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": (
                "2568-08-30",
                "17:00",
                "19:00"
                ),
            "final": None
            },

           "511113": {

            "name": "แคลคูลัสสำหรับเทคโนโลยีสารสนเทศ",
            "classes": [
                ("จันทร์", "13:00", "14:45"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"
                )
            },
            "517121": {

                "name": "ทักษะการเขียนโปรแกรมคอมพิวเตอร์ 1",
                "classes": [
                    ("จันทร์", "09:25", "12:05"),
                    ("อังคาร", "14:50", "16:35"),
                    ("พุธ", "13:00", "14:45"),
                    ("ศุกร์", "16:40", "18:25")
                ],

                "midterm": (
                    "2568-09-08",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2568-10-28",
                    "09:00",
                    "17:30"
                )
            },
            "520101": {

                "name": "พื้นฐานคอมพิวเตอร์และวิทยาการสารสนเทศ",
                "classes": [
                    ("ศุกร์", "08:30", "10:15"),
                    ("ศุกร์", "13:00", "14:45")
                ],

                "midterm": (
                    "2568-09-07",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-10-31",
                    "09:00",
                    "11:00"

                )

           }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "517122": {

                "name": "ทักษะการเขียนโปรแกรมคอมพิวเตอร์ 2",
                "classes": [
                    ("พุธ", "08:30", "12:05"),
                    ("อังคาร", "13:00", "14:45"),
                    ("อังคาร", "16:40", "18:25")
                ],

                "midterm": (
                    "2569-01-30",
                    "13:00",
                    "17:00"
                ),
                "final": (
                    "2027-03-25",
                    "09:00",
                    "17:30"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "SU203": {

            "name": "ทักษะการสื่อสารอย่างสร้างสรรค์",
            "classes": [
                ("พุธ", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            "520111": {

                "name": "โครงสร้างเชิงคำนวณแบบไม่ต่อเนื่อง",
                "classes": [
                    ("พฤหัสบดี", "13:55", "16:35")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "12:00"
                )
 ,
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "520112": {

                "name": "เว็บเทคโนโลยี",
                "classes": [
                    ("จันทร์", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2027-03-24",
                    "13:30",
                    "16:30"

                )

            
            }

        }

    },
    "วิทยาการข้อมูล": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511110": {

            "name": "แคลคูลัสสำหรับการวิเคราะห์ช้อมูล 1",
            "classes": [
                ("จันทร์", "14:50", "16:35"),
                ("ศุกร์", "08:30", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },
            "SU301": {

            "name": "พลเมืองตื่นรู้",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": (
                "2568-08-30",
                "17:00",
                "19:00"
                ),
            "final": None
            },

           "515104": {

                "name": "สถิติสำหรับคอมพิวเตอร์",
                "classes": [
                    ("พุธ", "10:20", "12:05"),
                    ("ศุกร์", "10:20", "12:05")
                ],

                "midterm": (
                    "2568-09-06",
                    "09:00",
                    "16:00"
                ),
                "final": (
                    "2568-10-30",
                    "09:00",
                    "16:30"
                )
            },
            "517111": {

                "name": "การเขียนโปรแกรมคอมพืวเตอร์สำหรับนักวิทยาการข้อมูล",
                "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("จันทร์", "13:00", "14:45")
                ],

                "midterm": (
                    "2568-09-08",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2568-10-28",
                    "09:00",
                    "16:30"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511111": {

                "name": "แคลคูลัสสำหรับการวิเคราะห์ข้อมูล 2",
                "classes": [
                    ("จันทร์", "08:30", "10:15"),
                    ("พุธ", "14:45", "16:35")
                ],

                "midterm": (
                    "2569-01-25",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-23",
                    "09:00",
                    "12:00"
                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "SU203": {

            "name": "ทักษะการสื่อสารอย่างสร้างสรรค์",
            "classes": [
                ("พุธ", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            "515271": {

                "name": "ความน่าจะเป็นสำหรับนักวิทยาการข้อมูล",
                "classes": [
                    ("พฤหัสบดี", "14:50", "16:35"),
                    ("อังคาร", "15:45", "16:35")
                ],

                "midterm": (
                    "2569-01-25",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "522151": {

                "name": "พื้นฐานวิทยาการข้อมูล",
                "classes": [
                    ("จันทร์", "10:20", "12:55")
                ],

                "midterm": (
                    "2569-01-27",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-16",
                    "10:00",
                    "13:00"
                )

            }

        }

    },
    "เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511106": {

            "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 1",
            "classes": [
                ("จันทร์", "12:10", "13:50"),
                ("อังคาร", "13:00", "14:45")
            ],
            "midterm": (
                "2568-09-07",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            "SU101": {

            "name": "ศิลปะศิลปากร",
            "classes": [
                ("อังคาร", "13:00", "15:40")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "08:30", "10:15"),
                ("พุธ", "09:25", "10:15")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พฤหัสบดี", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "11:15", "12:05")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )
            },
            "514101": {

            "name": "ฟิสิกส์ทั่วไป 1",
            "classes": [
                ("จันทร์", "10:20", "12:05"),
                ("ศุกร์", "10:20", "11:10")
            ],
            "midterm": (
                "2568-09-10",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-27",
                "09:00",
                "12:00"
                )
            },
            
            "514108": {

            "name": "ปฎิบัติการฟิสิกส์ทั่วไป 1",
            "classes": [
                ("ศุกร์", "13:00", "15:40")
            ],
            "midterm": None
            ,
            "final": (
                "2568-10-28",
                "09:00",
                "11:00"
                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "511107": {

                "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ 2",
                "classes": [
                    ("อังคาร", "10:20", "12:05"),
                    ("พฤหัสบดี", "10:20", "12:05")
                ],

                "midterm": (
                    "2569-01-25",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-25",
                    "13:30",
                    "16:30"

                )

            },
            "SU102": {

            "name": "ศิลปากรสร้างสรรค์",
            "classes": [
                ("พฤหัสบดี", "16:40", "19:20")
            ],
            "midterm": None ,
            "final": None
            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            "513104": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("อังคาร", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"

                )

            },
            "518101": {

                "name": "จุลชีววิทยาทั่วไป",
                "classes": [
                    ("จันทร์", "09:25", "12:05")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "12:00"

                )

            },
            "518102": {

                "name": "ปฎิบัติการจุลชีววิทยาทั่วไป",
                "classes": [
                    ("พฤหัสบดี", "15:45", "16:35"),
                    ("พุธ", "09:25", "12:05")
                ],

                "midterm": (
                    "2569-01-31",
                    "13:00",
                    "16:00"
                ),
                "final": (
                    "2569-03-27",
                    "13:30",
                    "16:30"

                )

            }
            

        }

    },
    "เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง": {

        # -------------------- เทอม 1 --------------------

        "1": {

            "511114": {

            "name": "คณิตศาสตร์ทั่วไป",
            "classes": [
                ("จันทร์", "13:55", "15:40"),
                ("อังคาร", "13:00", "14:45"),
                ("จันทร์", "15:45", "16:35")
            ],
            "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-29",
                "09:00",
                "12:00"

                )
            },
            
            "SU201": {

            "name": "ภาษาอังกฤษในยุคดิจิทัล",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2568-11-01",
                "09:00",
                "12:00"
                )
            },

           "512101": {

            "name": "ชีววิทยาทั่วไป",
            "classes": [
                ("จันทร์", "13:00", "13:50"),
                ("พุธ", "10:20", "12:05")
            ],
            "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"

            ),
            "final": (
                "2568-10-31",
                "09:00",
                "12:00"
                )
            },
            "512102": {

            "name": "ปฎิบัติการชีววิทยาทั่วไป",
            "classes": [
                ("พฤหัสบดี", "13:00", "15:40")
            ],
            "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"

            ),
            "final": (
                "2568-10-30",
                "13:30",
                "16:30"
                )
            },
            "513101": {

                "name": "เคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "08:30", "10:15"),
                    ("ศุกร์", "11:15", "12:05 ")
                ],

                "midterm": (
                    "2568-09-12",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2568-11-04",
                    "09:00",
                    "12:00"

                )

            },
            "513103": {

                "name": "ปฎิบัติการเคมีทั่วไป 1",
                "classes": [
                    ("พุธ", "13:00", "15:40")
                ],

                "midterm": (
                    "2568-09-13",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-11-04",
                    "13:30",
                    "15:30"

                )
            }
        },


        # -------------------- เทอม 2 --------------------

        "2": {

            "513102": {

                "name": "เคมีทั่วไป 2",
                "classes": [
                    ("จันทร์", "08:30", "09:25"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-26",
                    "09:00",
                    "12:00"
                ),
                "final": (
                    "2569-03-24",
                    "09:00",
                    "12:00"

                )

            },
            
            "SU202": {

            "name": "ภาษาอังกฤษเพื่อการสื่อสารนานาชาติ",
            "classes": [
                ("อังคาร", "10:20", "12:05"),
                ("พฤหัสบดี", "10:20", "12:05")
            ],
            "midterm": None ,
            "final": (
                "2569-03-28",
                "09:00",
                "12:00"
                )
            },
            "513102": {

                "name": "ปฎิบัติการเคมีทั่วไป 2",
                "classes": [
                    ("อังคาร", "13:00", "15:40")
                ],

                "midterm": (
                    "2569-01-26",
                    "13:00",
                    "15:00"
                ),
                "final": (
                    "2569-03-23",
                    "13:30",
                    "15:30"


                )

            },
            "518103": {

            "name": "จุลชีววิทยาทั่วไปสำหรับเครื่องสำอาง",
            "classes": [
                ("ศุกร์", "13:00", "15:40")
            ],
            "midterm": (
                "2569-01-24",
                "09:00",
                "12:00"

            ),
            "final": (
                "2569-03-30",
                "09:00",
                "12:00"
                )
            },
            
            "525101": {

            "name": "เคมีเบื้องต้นสำหรับเครื่องสำอาง",
            "classes": [
                ("จันทร์", "13:00", "14:45")
            ],
            "midterm": (
                "2569-01-28",
                "13:00",
                "15:00"

            ),
            "final": (
                "2569-03-25",
                "09:00",
                "11:00"
                )

            }
        }

    }
}

# ============================================================
# 2. ข้อมูลวิชาเสรี
#
#    แยกตาม เทอม 1 / เทอม 2
# ============================================================
ELECTIVE_COURSES = {
    # ========================================================
    # เทอม 1
    # ========================================================
    "1": {
    # ========================================================
    # 511 : คณิตศาสตร์ / แคลคูลัส
    # ========================================================
    "511100": {
        "name": "ความรู้พื้นฐานสำหรับแคลคูลัส",
        
        "description": """
        สมบัติของจำนวนจริง ค่าสัมบูรณ์ อัตราส่วน ร้อยละ
        การเทียบบัญญัติไตรยางศ์ พหุนาม เศษส่วนของพหุนาม
        การแก้สมการและอสมการพหุนาม ระบบสมการเชิงเส้น
        ฟังก์ชัน ฟังก์ชันผกผัน ฟังก์ชันเชิงกำลัง
        ฟังก์ชันลอการิทึม กราฟของฟังก์ชันพื้นฐาน
        ทฤษฎีบทพีทาโกรัส ฟังก์ชันตรีโกณมิติ
        """,

        "classes": [
            ("จันทร์", "13:00", "13:50"),
            ("ศุกร์", "10:20", "12:05"),
            ("พุธ", "16:40", "18:25")
            ],

        "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-11-02",
                "09:00",
                "12:00"
            )

    },
    "SU132": {

        "name": "โลกและดาราศาสตร์ในสหัสวรรษที่ 3",

        "description": """
        ปรากฏการณ์ทางธรรมชาติบนโลก บรรยากาศโลก
        การพยากรณ์ทางอุตุนิยมวิทยา การเปลี่ยนแปลงสภาพภูมิอากาศและผลกระทบ
        ปรากฏการณ์ทางดาราศาสตร์ การสังเกตการณ์ทางดาราศาสตร์
        ระบบสุริยะและดาวฤกษ์ การประยุกต์ใช้ในชีวิตประจำวัน
        ปรากฏการณ์และเหตุการณ์ในสหัสวรรษที่ 3
        """,

        "classes": [
            ("พฤหัสบดี", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU134": {

        "name": "ความรอบรู้ทางด้านคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสาร",

        "description": """
        บทบาทและความสำคัญของคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสารในปัจจุบัน
        แนวโน้มในอนาคต ความรู้พื้นฐาน การประยุกต์อย่างสร้างสรรค์ การรักษาความมั่นคง
        กฎหมายและจริยธรรมที่เกี่ยวข้อง""",

        "classes": [

            ("พุธ", "16:40", "20:15")

        ],

        "midterm": None,

        "final": None

    },

    "SU139": {

        "name": "การพัฒนาภาวะผู้นำ",

        "description": """
        ทฤษฎีความต้องการของมนุษย์และภาวะผู้นำ ทักษะจำเป็นในการเป็นผู้นำ
        การพัฒนาภาวะผู้นำ ความแตกต่างของวัฒนธรรมสำหรับผู้นำ การสร้างทีม
        การสร้างแรงจูงใจ มนุษยสัมพันธ์ การแก้ปัญหา การตัดสินใจ
        การบริหารความขัดแย้ง การสื่อสารและการควบคุม และการจัดการความเครียด
        """,

        "classes": [

            ("พุธ", "16:40", "20:15")

        ],

        "midterm": None,

        "final": None

    },

    "SU140": {

        "name": "การอนุรักษ์สิ่งแวดล้อมธรรมชาติและศิลปกรรม",

        "description": """
        ความรู้พื้นฐานด้านสิ่งแวดล้อมและทรัพยากรธรรมชาติ ปัญหาด้านสิ่งแวดล้อม
        ผลกระทบของภัยคุกคามทางกายภาพ เคมี และชีวภาพต่อศิลปกรรม
        บริการของระบบนิเวศและการท่องเที่ยวเชิงนิเวศ
        หลักการพื้นฐานในการอนุรักษ์สิ่งแวดล้อมทางธรรมชาติและศิลปกรรม
        การประยุกต์ความรู้ด้านวิทยาศาสตร์ในการอนุรักษ์สิ่งแวดล้อมธรรมชาติ
        ศิลปกรรม และมรดกโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU146": {

        "name": "โครงการพระราชดำริ",

        "description": """
        ปรัชญา ความหมาย และความสำคัญของศาสตร์พระราชา
        ความเป็นมาของโครงการพระราชดำริในพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช
        โครงการเกี่ยวกับดิน น้ำ ป่า อาชีพ และวิศวกรรม หลักปรัชญาของเศรษฐกิจพอเพียง
        ทฤษฎีใหม่ แนวทางการประยุกต์ใช้เพื่อการพัฒนาตนเอง ชุมชน สังคม และประเทศชาติ
        มีการศึกษานอกสถานที่""",

        "classes": [

            ("พฤหัสบดี", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU194": {

        "name": "สิ่งแวดล้อม มลพิษ และพลังงาน ในชีวิตประจำวัน",

        "description": """
        ระบบนิเวศ มลพิษทางน้ำ มลพิษทางอากาศ
        มลพิษทางดิน มูลฝอย
        พลังงานและผลกระทบต่อภาวะภูมิอากาศของโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU313": {

        "name": "ธรรมชาติวิจักษ์",

        "description": """
        ความหลากหลายทางชีวภาพ
        ความสำคัญและบทบาทของสิ่งมีชีวิต
        คุณค่าและความงามของธรรมชาติ
        การสร้างจิตสำนึกในการอนุรักษ์และความรับผิดชอบต่อสังคม
        """,

        "classes": [

            ("พฤหัสบดี", "16:40", "19:20")

        ],

        "midterm": None,

        "final": None

    },

    "SU315": {

        "name": "การอนุรักษ์สิ่งแวดล้อมธรรมชาติและศิลปกรรม",

        "description": """
        ความรู้พื้นฐานด้านสิ่งแวดล้อมและทรัพยากรธรรมชาติ
        ปัญหาด้านสิ่งแวดล้อม ผลกระทบของภัยคุกคามทางกายภาพ
        เคมี และชีวภาพต่อศิลปกรรม บริการของระบบนิเวศและการท่องเที่ยวเชิงนิเวศ
        หลักการพื้นฐานในการอนุรักษ์สิ่งแวดล้อมทางธรรมชาติและศิลปกรรม
        การประยุกต์ความรู้ด้านวิทยาศาสตร์ในการอนุรักษ์สิ่งแวดล้อมธรรมชาติ
        ศิลปกรรม และมรดกโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU316": {

        "name": "โลกของจุลินทรีย์",

        "description": """
        ประโยชน์และความสำคัญของจุลินทรีย์ต่อวงการอาหาร
        อุตสาหกรรมการเกษตรและการแพทย์ต่อมนุษย์ในชีวิตประจำวัน
        การใช้จุลินทรีย์โดยคำนึงถึงความปลอดภัยของผู้บริโภคและสิ่งแวดล้อม
        """,

        "classes": [

            ("อังคาร", "16:40", "19:20")

        ],

        "midterm": (
                    "2568-09-02",
                    "16:40",
                    "18:40"
                ),
                "final": (
                    "2568-10-21",
                    "16:40",
                    "18:40"


                )

    },

    "SU318": {

        "name": "สิ่งแวดล้อม มลพิษและพลังงาน",

        "description": """
        ระบบนิเวศ มลพิษทางน้ำ
        มลพิษทางอากาศ มลพิษทางดิน
        มูลฝอย พลังงานและผลกระทบต่อภาวะภูมิอากาศของโลก
        เก็บ A ง่าย
        เรียนสบาย นอนเรียน
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },
    "511103": {

        "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ",

        "description": """
        เมทริกซ์และการแก้ระบบสมการเชิงเส้น
        สมบัติทางพีชคณิตและเรขาคณิตของเวกเตอร์
        ความสัมพันธ์และฟังก์ชัน ฟังก์ชันอดิศัย
        อัตราการเปลี่ยนแปลง อนุพันธ์ ปริพันธ์
        พื้นที่ระหว่างเส้นโค้ง อนุกรมเทย์เลอร์
        อนุกรมแมคคลอริน สมการเชิงอนุพันธ์อันดับหนึ่ง
        แบบแยกตัวแปรได้และการประยุกต์
        """,

       "classes": [
            ("จันทร์", "13:00", "14:45"),
            ("พุธ", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-10-29",
                "09:00",
                "12:00"
            )
    },


    "511104": {

        "name": "แคลคูลัสสำหรับวิศวกร 1",

        "description": """
        ลิมิตและความต่อเนื่อง การหาอนุพันธ์และการประยุกต์
        ในทางวิศวกรรมศาสตร์ ค่าสุดขีดของฟังก์ชัน
        รูปแบบยังไม่กำหนด กฎของโลปิตาล
        ลำดับและอนุกรมอนันต์ อนุกรมกำลัง
        อนุกรมเทย์เลอร์และอนุกรมแมคคลอริน
        """,

       "classes": [
            ("อังคาร", "10:20", "12:05"),
            ("พฤหัสบดี", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-10-29",
                "13:30",
                "16:30"
            )
     },


    "511105": {

        "name": "แคลคูลัสสำหรับวิศวกรวัสดุ",

        "description": """
        ลิมิตและความต่อเนื่อง การหาอนุพันธ์และการประยุกต์
        ในทางวิศวกรรมศาสตร์ การหาปริพันธ์ของฟังก์ชันค่าจริง
        เทคนิคการหาปริพันธ์ การประยุกต์การหาปริพันธ์
        ในทางวิศวกรรมศาสตร์ สมการเชิงอนุพันธ์เบื้องต้น
        และการประยุกต์ในทางวิศวกรรมศาสตร์
        และพิกัดเชิงขั้ว
        """,
        "classes": [
            ("จันทร์", "13:55", "15:40"),
            ("พฤหัสบดี", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-06",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-10-28",
                "13:30",
                "16:30"
            )

    },


    "511110": {

        "name": "แคลคูลัสสำหรับการวิเคราะห์ข้อมูล 1",

        "description": """
        ลิมิตและความต่อเนื่อง อนุพันธ์และการประยุกต์
        ปริพันธ์ไม่จำกัดเขตและปริพันธ์จำกัดเขตและการประยุกต์
        การหาอนุพันธ์และการหาปริพันธ์ของฟังก์ชันอดิศัย
        ปริพันธ์ไม่ตรงแบบ ลำดับและอนุกรมอนันต์
        อนุกรมกำลัง อนุกรมเทย์เลอร์และอนุกรมแมคคลอริน
        """,

        "classes": [
            ("จันทร์", "14:50", "16:35"),
            ("ศุกร์", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-08",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-10-29",
                "09:00",
                "12:00"
            )


    },


    "511114": {

        "name": "คณิตศาสตร์ทั่วไป",

        "description": """
        การบวก ลบ คูณ หาร จำนวนจริง เศษส่วน ร้อยละ
        อัตราส่วน สมการพหุนาม ค่าสัมบูรณ์
        ฟังก์ชันพื้นฐาน ระบบสมการเชิงเส้น
        เลขยกกำลัง ฟังก์ชันเอกซ์โพเนนเชียล
        ฟังก์ชันลอการิทึมและการประยุกต์
        แคลคูลัสเบื้องต้น
        """,

        "classes": [
            ("จันทร์", "13:55", "16:35"),
            ("อังคาร", "13:00", "14:45")
            ],

        "midterm": (
                "2568-09-14",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-10-29",
                "09:00",
                "12:00"
            )

    },


    "511117": {

        "name": "คณิตศาสตร์พื้นฐานสำหรับวิศวกรเคมี",

        "description": """
        ฟังก์ชัน ลิมิตและความต่อเนื่อง การหาอนุพันธ์
        การหาปริพันธ์ การหาปริพันธ์หลายชั้น
        สมการเชิงอนุพันธ์ อนุกรม เวกเตอร์และเมทริกซ์
        ตัวแปรเชิงซ้อน ระบบพิกัด
        """,

        "classes": [
            ("อังคาร", "10:20", "12:05"),
            ("พฤหัสบดี", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-06",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-10-29",
                "13:30",
                "16:30"
            )

    },
    # ========================================================

    # 512 : ชีววิทยา

    # ========================================================

    "512105": {

        "name": "ชีววิทยาพื้นฐาน",

        "description": """
        แนวคิดทางชีววิทยา การจัดระบบของสิ่งมีชีวิต
        เซลล์และองค์ประกอบของเซลล์
        สารเคมีในสิ่งมีชีวิต
        โครงสร้างและการทำงานของระบบอวัยวะ
        พฤติกรรมและการปรับตัว นิเวศวิทยา พันธุศาสตร์
        """,

        "classes": [
            ("จันทร์", "08:30", "10:15"),
            ("ศุกร์", "09:25", "10:15")
            ],

        "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-11-03",
                "09:00",
                "12:00"
            )

    },


    "512108": {

        "name": "ชีววิทยาสำหรับวิทยาศาสตร์ประยุกต์",

        "description": """
        สมบัติของสิ่งมีชีวิต การจัดจำแนกสิ่งมีชีวิต
        สารเคมีของสิ่งมีชีวิต เมแทบอลิซึม
        องค์ประกอบและการทำงานของเซลล์
        อวัยวะและระบบของสิ่งมีชีวิต
        พันธุศาสตร์ พันธุศาสตร์โมเลกุล
        พันธุศาสตร์ประชากร กลไกของวิวัฒนาการ
        โครงสร้างและการทำงานของพืชและสัตว์
        นิเวศวิทยาและพฤติกรรมสัตว์
        ความสัมพันธ์ของชีววิทยากับศาสตร์แขนงอื่น
        """,

        "classes": [
            ("จันทร์", "13:00", "13:50"),
            ("พุธ", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-08",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-10-31",
                "09:00",
                "12:00"
            )

    },


    # ========================================================

    # 513 : เคมี

    # ========================================================

    "513100": {

        "name": "เคมีทั่วไป",

        "description": """
        ปริมาณสัมพันธ์ ทฤษฎีอะตอม โครงสร้างอะตอม
        และสมบัติของธาตุตามตารางธาตุ
        เคมีของธาตุในกลุ่มหลัก อโลหะและโลหะทรานซิชัน
        พันธะเคมี สมบัติของแก๊ส ของเหลว ของแข็ง
        และสารละลาย สมดุลเคมีและสมดุลของไอออน
        จลนพลศาสตร์เคมี
        """,

        "classes": [
            ("จันทร์", "08:30", "09:20"),
            ("พุธ", "13:00", "14:45")
            ],

        "midterm": (
                "2568-09-11",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-11-03",
                "09:00",
                "12:00"
            )

    },


    "513108": {

        "name": "เคมีทั่วไปสำหรับนักศึกษาเภสัชศาสตร์",

        "description": """
        ปริมาณสัมพันธ์ โครงสร้างอะตอมและสมบัติของธาตุ
        ตามตารางธาตุ พันธะเคมี แก๊ส ของแข็ง
        เทอร์โมไดนามิกส์ ของเหลวและสารละลาย
        สมดุลเคมีและสมดุลของไอออน
        """,

        "classes": [
            ("อังคาร", "08:30", "10:15"),
            ("พุธ", "13:00", "13:50"),
            ("พฤหัสบดี", "11:15", "12:05")
            ],

        "midterm": (
                "2568-09-12",
                "09:00",
                "12:00"
            ),

        "final": (
                "2568-11-04",
                "09:00",
                "12:00"
            )

    },


    "513110": {

        "name": "เคมีพื้นฐานสำหรับวิศวกรเคมี",

        "description": """
        ปริมาณสัมพันธ์ ทฤษฎีอะตอม โครงสร้างอะตอม
        และสมบัติของธาตุตามตารางธาตุ
        เคมีของธาตุในกลุ่มหลัก อโลหะและโลหะทรานซิชัน
        พันธะเคมี สมบัติของแก๊ส ของเหลว ของแข็ง
        และสารละลาย สมดุลเคมีและสมดุลของไอออน
        จลนเคมี

        """,

        "classes": [
            ("พุธ", "13:00", "13:50"),
            ("ศุกร์", "13:00", "14:45")
            ],

        "midterm": (
                "2568-09-11",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-10-28",
                "09:00",
                "12:00"
            )

    },


    # ========================================================

    # 514 : ฟิสิกส์

    # ========================================================

    "514107": {

        "name": "ฟิสิกส์พื้นฐาน",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        การสั่นและคลื่น อุณหพลศาสตร์
        กลศาสตร์ของไหล เสียง สนามไฟฟ้า
        สนามแม่เหล็ก ทัศนศาสตร์ ฟิสิกส์ยุคใหม่
        """,

        "classes": [
            ("อังคาร", "08:30", "10:15"),
            ("พฤหัสบดี", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-10",
                "13:00",
                "16:00"
            ),

        "final": (
                "2568-10-27",
                "13:30",
                "16:30"
            )

    },


    "514110": {

        "name": "ฟิสิกส์ทั่วไปสำหรับวิศวกรวัสดุ",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        สมบัติของสสาร กลศาสตร์ของของไหล
        ทฤษฎีจลน์ของแก๊ส การสั่นและคลื่น
        เสียง ควอนตัมฟิสิกส์
        """,

        "classes": [
            ("จันทร์", "08:30", "10:15"),
            ("พุธ", "08:30", "09:20")
            ],

        "midterm": (
                "2568-09-11",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2568-10-30",
                "09:00",
                "12:00"
            )

    },


    "514112": {

        "name": "ฟิสิกส์พื้นฐานสำหรับวิศวกรรมอุตสาหการ",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        กลศาสตร์ของของไหล ทฤษฎีจลน์ของแก๊ส
        เทอร์โมไดนามิกส์
        การวิเคราะห์วงจรไฟฟ้าเบื้องต้น
        """,

        "classes": [
            ("พุธ", "08:30", "09:20"),
            ("พฤหัสบดี", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-11",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2568-10-30",
                "09:00",
                "12:00"
            )
    },


    "514114": {

        "name": "ฟิสิกส์พื้นฐานสำหรับวิศวกรเคมี",

        "description": """
        แรงและการเคลื่อนที่ โมเมนตัม งานและพลังงาน
        แก๊ส ของเหลว ของแข็ง แรงแม่เหล็ก ไฟฟ้า
        คลื่น เสียง ทัศนศาสตร์ สัมพัทธภาพ
        โฟตอน กลศาสตร์ควอนตัม
        """,

        "classes": [
            ("จันทร์", "13:55", "15:40"),
            ("พุธ", "13:55", "14:45")
            ],

        "midterm": (
                "2568-09-12",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2568-10-30",
                "09:00",
                "12:00"
            )

    },


    "514231": {

        "name": "ข้อมูลฟิสิกส์สำหรับนักวิทยาศาสตร์",

        "description": """
        ปริมาณทางกายภาพและระบบหน่วย
        วิธีรวบรวมข้อมูลทางกายภาพ
        การวิเคราะห์และแปลความหมายข้อมูลทางกายภาพ
        การนำเสนอ การจัดการข้อมูล
        """,

        "classes": [
            ("จันทร์", "13:00", "14:45"),
            ("พุธ", "13:00", "14:45")
            ],

        "midterm": (
                "2568-09-13",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2568-11-05",
                "09:00",
                "12:00"
            )

    },


    # ========================================================

    # 515 : สถิติ

    # ========================================================

    "515104": {

        "name": "สถิติสำหรับคอมพิวเตอร์",

        "description": """
        ความหมายและประเภทของสถิติ การเก็บรวบรวมข้อมูล
        ข้อมูลและระดับการวัด สถิติพรรณนา
        การนำเสนอข้อมูล ความน่าจะเป็น
        ตัวแปรสุ่มและการแจกแจงความน่าจะเป็น
        การแจกแจงทวินาม ปัวซอง ปกติ
        และการแจกแจงแบบเลขชี้กำลัง
        การแจกแจงค่าตัวอย่าง
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐาน สถิติไม่อิงพารามิเตอร์
        การถดถอยอย่างง่ายและสหสัมพันธ์
        การวิเคราะห์ความแปรปรวน
        การประยุกต์สถิติเพื่อประมวลผลข้อมูล
        และการใช้ภาษาโปรแกรมในการวิเคราะห์
        """,

        "classes": [
            ("พุธ", "10:20", "12:05"),
            ("ศุกร์", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-06",
                "09:00",
                "16:00"
            ) ,

        "final": (
                "2568-10-30",
                "13:30",
                "16:30"
            )


    },


    "515105": {

        "name": "สถิติสำหรับเทคโนโลยีสารสนเทศ",

        "description": """
        ความหมายและประเภทของสถิติ การเก็บรวบรวมข้อมูล
        ข้อมูลและระดับการวัด สถิติพรรณนา
        การนำเสนอข้อมูล ความน่าจะเป็น
        ตัวแปรสุ่ม การแจกแจงความน่าจะเป็น
        การแจกแจงทวินาม ปัวซอง ปกติ
        การแจกแจงแบบเลขชี้กำลัง
        การแจกแจงค่าตัวอย่าง
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐาน สถิติที่ไม่ใช้พารามิเตอร์
        การถดถอยอย่างง่ายและสหสัมพันธ์
        การวิเคราะห์ความแปรปรวน
        การประยุกต์สถิติและการใช้โปรแกรม
        ในการวิเคราะห์และแปลผล
        """,

        "classes": [
            ("พฤหัสบดี", "08:30", "10:15"),
            ("ศุกร์", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-07",
                "09:00",
                "16:00"
            ) ,

        "final": (
                "2568-11-04",
                "09:00",
                "16:30"
            )

    },


    "515201": {

        "name": "สถิติพื้นฐาน",

        "description": """
        ธรรมชาติของสถิติและแนวทางการประยุกต์โดยทั่วไป
        สถิติพรรณนาและความน่าจะเป็น
        การแจกแจงความน่าจะเป็นของตัวแปรสุ่ม
        การเลือกตัวอย่างและการแจกแจงค่าตัวอย่าง
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐาน การวิเคราะห์ความแปรปรวน
        การทดสอบไคกำลังสอง สถิติไม่อิงพารามิเตอร์
        การถดถอยอย่างง่ายและสหสัมพันธ์
        การใช้ภาษาโปรแกรมหรือโปรแกรมสำเร็จรูปในการวิเคราะห์
        """,

        "classes": [
            ("พุธ", "10:20", "12:05"),
            ("ศุกร์", "10:20", "12:05")
            ],

        "midterm": (
                "2568-09-06",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2568-10-30",
                "09:00",
                "16:30"
            )


    },


    "515203": {

        "name": "สถิติสำหรับนักวิทยาศาสตร์ชีวภาพ 1",

        "description": """
        ความหมายและประเภทของสถิติ ประเภทของข้อมูล
        สถิติพรรณนา การนำเสนอข้อมูล
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐานทางสถิติเกี่ยวกับค่าเฉลี่ย
        และความแปรปรวนสำหรับหนึ่งประชากร
        สองประชากรและหลายประชากร
        สถิติที่ไม่อิงพารามิเตอร์
        การตรวจสอบการแจกแจงปรกติ การแปลงข้อมูล
        การวิเคราะห์สหสัมพันธ์และการถดถอยอย่างง่าย
        การวิเคราะห์ความเกี่ยวพันสำหรับตัวแปรจำแนกประเภท
        การใช้โปรแกรมสำเร็จรูปในการวิเคราะห์และแปลผล
        """,

        "classes": [
            ("จันทร์", "13:55", "15:40"),
            ("อังคาร", "14:50", "16:35")
            ],

        "midterm": (
                "2568-09-08",
                "09:00",
                "16:00"
            ) ,

        "final": (
                "2568-10-31",
                "09:00",
                "16:30"
            )

    },


    "515203": {

        "name": "สถิติสำหรับนักวิทยาศาสตร์ชีวภาพ 1",

        "description": """
        ความหมายและประเภทของสถิติ ประเภทของข้อมูล
        สถิติพรรณนา การนำเสนอข้อมูล
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐานทางสถิติเกี่ยวกับค่าเฉลี่ย
        และความแปรปรวนสำหรับหนึ่งประชากร
        สองประชากรและหลายประชากร
        สถิติที่ไม่อิงพารามิเตอร์
        การตรวจสอบการแจกแจงปรกติ การแปลงข้อมูล
        การวิเคราะห์สหสัมพันธ์และการถดถอยอย่างง่าย
        การวิเคราะห์ความเกี่ยวพันสำหรับตัวแปรจำแนกประเภท
        การใช้โปรแกรมสำเร็จรูปในการวิเคราะห์และแปลผล
        """,

        "classes": [
            ("จันทร์", "13:55", "15:40"),
            ("ศุกร์", "13:00", "14:45")
            ],

        "midterm": (
                "2568-09-08",
                "09:00",
                "16:00"
            ) ,

        "final": (
                "2568-10-28",
                "09:00",
                "11:00"
            )

    },


    "515232": {

        "name": "ความน่าจะเป็นสำหรับนักวิทยาการคอมพิวเตอร์",

        "description": """
        แนวความคิดพื้นฐานของความน่าจะเป็น
        ความน่าจะเป็นแบบมีเงื่อนไขและความเป็นอิสระกัน
        ของเหตุการณ์ ทฤษฎีบทของเบส์
        ตัวแปรสุ่มและการแจกแจงความน่าจะเป็น
        ค่าคาดหมาย การแจกแจงความน่าจะเป็นร่วม
        ความเป็นอิสระกันของตัวแปรสุ่ม
        อสมการความน่าจะเป็น
        การลู่เข้าของลำดับของตัวแปรสุ่ม
        กฎจำนวนมาก
        """,

        "classes": [
            ("จันทร์", "08:30", "10:15"),
            ("อังคาร", "10:20", "11:10")
            ],

        "midterm": (
                "2568-09-09",
                "13:00",
                "16:00"
            ) ,

        "final": (
                "2568-11-05",
                "13:30",
                "16:30"
            )
    },


    "515273": {

        "name": "สถิติสำหรับวิทยาการข้อมูล",

        "description": """
        การถดถอยเชิงเส้นพหุคูณ
        การถดถอยลอจิสติกทวิภาค
        การถดถอยหลายตัวแปร
        การประเมินและคัดเลือกตัวแบบ
        การทดสอบเชิงสถิติสำหรับเวกเตอร์ค่าเฉลี่ย
        และเมทริกซ์ความแปรปรวนร่วม
        """,

        "classes": [
            ("อังคาร", "13:00", "14:45"),
            ("พฤหัสบดี", "08:30", "10:15")
            ],

        "midterm": (
                "2568-09-02",
                "09:00",
                "16:00"
            ) ,

        "final": (
                "2568-11-04",
                "09:00",
                "16:30"
        )
    },


    # ========================================================

    # 517 : Programming / Data Science

    # ========================================================

    "517111": {

        "name": "การเขียนโปรแกรมคอมพิวเตอร์สำหรับนักวิทยาการข้อมูล",

        "description": """
        ขั้นตอนการแก้ปัญหา ผังงาน
        การเขียนโปรแกรมเบื้องต้น ชนิดของข้อมูล
        การประมวลผลข้อมูล
        ฟังก์ชันและไลบรารี่มาตรฐาน
        """,

        "classes": [
                    ("จันทร์", "10:20", "12:05"),
                    ("จันทร์", "13:00", "14:45")
                ],

                "midterm": (
                    "2568-09-08",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2568-10-28",
                    "09:00",
                    "16:30"
                )

    },


    # ========================================================

    # 520 : Computer / Informatics

    # ========================================================

    "520101": {

        "name": "พื้นฐานคอมพิวเตอร์และวิทยาการสารสนเทศ",

        "description": """
        ภาพรวมของศาสตร์ทางคอมพิวเตอร์และเทคโนโลยีสารสนเทศ
        วิวัฒนาการของเทคโนโลยีสารสนเทศ
        แนวคิดพื้นฐานสำหรับการสร้างโปรแกรม
        เทคโนโลยีฐานข้อมูล การสื่อสารข้อมูล
        ประเด็นทางด้านจริยธรรม
        ผลกระทบของคอมพิวเตอร์และระบบสารสนเทศต่อสังคม
        การทำงานร่วมกันเป็นทีม
        และโดเมนแอปพลิเคชัน
        """,

        "classes": [
                    ("ศุกร์", "08:30", "10:15"),
                    ("ศุกร์", "13:00", "14:45")
                ],

                "midterm": (
                    "2568-09-07",
                    "09:00",
                    "11:00"
                ),
                "final": (
                    "2568-10-31",
                    "09:00",
                    "11:00"
                )
            }
        },
"2": {

        "511100": {
        "name": "ความรู้พื้นฐานสำหรับแคลคูลัส",
        
        "description": """
        สมบัติของจำนวนจริง ค่าสัมบูรณ์ อัตราส่วน ร้อยละ
        การเทียบบัญญัติไตรยางศ์ พหุนาม เศษส่วนของพหุนาม
        การแก้สมการและอสมการพหุนาม ระบบสมการเชิงเส้น
        ฟังก์ชัน ฟังก์ชันผกผัน ฟังก์ชันเชิงกำลัง
        ฟังก์ชันลอการิทึม กราฟของฟังก์ชันพื้นฐาน
        ทฤษฎีบทพีทาโกรัส ฟังก์ชันตรีโกณมิติ
        """,

        "classes": [
            ("จันทร์", "13:00", "14:45"),
            ("พุธ", "14:50", "16:35")
            ],

        "midterm": (
                "2569-01-25",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-26",
                "13:30",
                "16:30"
            )

        },
        "SU071001": {

        "name": "โลกและดาราศาสตร์ในสหัสวรรษที่ 3",

        "description": """
        ปรากฏการณ์ทางธรรมชาติบนโลก บรรยากาศโลก
        การพยากรณ์ทางอุตุนิยมวิทยา การเปลี่ยนแปลงสภาพภูมิอากาศและผลกระทบ
        ปรากฏการณ์ทางดาราศาสตร์ การสังเกตการณ์ทางดาราศาสตร์
        ระบบสุริยะและดาวฤกษ์ การประยุกต์ใช้ในชีวิตประจำวัน
        ปรากฏการณ์และเหตุการณ์ในสหัสวรรษที่ 3
        """,

        "classes": [
            ("พฤหัสบดี", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU071003": {

        "name": "ความรอบรู้ทางด้านคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสาร",

        "description": """
        บทบาทและความสำคัญของคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสารในปัจจุบัน
        แนวโน้มในอนาคต ความรู้พื้นฐาน การประยุกต์อย่างสร้างสรรค์ การรักษาความมั่นคง
        กฎหมายและจริยธรรมที่เกี่ยวข้อง""",

        "classes": [

            ("พุธ", "16:40", "20:15")

        ],

        "midterm": None,

        "final": None

    },
    "SU134": {

        "name": "ความรอบรู้ทางด้านคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสาร",

        "description": """
        บทบาทและความสำคัญของคอมพิวเตอร์ เทคโนโลยีสารสนเทศและการสื่อสารในปัจจุบัน
        แนวโน้มในอนาคต ความรู้พื้นฐาน การประยุกต์อย่างสร้างสรรค์ การรักษาความมั่นคง
        กฎหมายและจริยธรรมที่เกี่ยวข้อง
        เรียนง่าย
        A ง่าย
        """,

        "classes": [

            ("พุธ", "16:40", "20:15")

        ],

        "midterm": None,

        "final": None

    },

    "SU139": {

        "name": "การพัฒนาภาวะผู้นำ",

        "description": """
        ทฤษฎีความต้องการของมนุษย์และภาวะผู้นำ ทักษะจำเป็นในการเป็นผู้นำ
        การพัฒนาภาวะผู้นำ ความแตกต่างของวัฒนธรรมสำหรับผู้นำ การสร้างทีม
        การสร้างแรงจูงใจ มนุษยสัมพันธ์ การแก้ปัญหา การตัดสินใจ
        การบริหารความขัดแย้ง การสื่อสารและการควบคุม และการจัดการความเครียด
        """,

        "classes": [

            ("พุธ", "16:40", "20:15")

        ],

        "midterm": None,

        "final": None

    },

    "SU140": {

        "name": "การอนุรักษ์สิ่งแวดล้อมธรรมชาติและศิลปกรรม",

        "description": """
        ความรู้พื้นฐานด้านสิ่งแวดล้อมและทรัพยากรธรรมชาติ ปัญหาด้านสิ่งแวดล้อม
        ผลกระทบของภัยคุกคามทางกายภาพ เคมี และชีวภาพต่อศิลปกรรม
        บริการของระบบนิเวศและการท่องเที่ยวเชิงนิเวศ
        หลักการพื้นฐานในการอนุรักษ์สิ่งแวดล้อมทางธรรมชาติและศิลปกรรม
        การประยุกต์ความรู้ด้านวิทยาศาสตร์ในการอนุรักษ์สิ่งแวดล้อมธรรมชาติ
        ศิลปกรรม และมรดกโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU146": {

        "name": "โครงการพระราชดำริ",

        "description": """
        ปรัชญา ความหมาย และความสำคัญของศาสตร์พระราชา
        ความเป็นมาของโครงการพระราชดำริในพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช
        โครงการเกี่ยวกับดิน น้ำ ป่า อาชีพ และวิศวกรรม หลักปรัชญาของเศรษฐกิจพอเพียง
        ทฤษฎีใหม่ แนวทางการประยุกต์ใช้เพื่อการพัฒนาตนเอง ชุมชน สังคม และประเทศชาติ
        มีการศึกษานอกสถานที่""",

        "classes": [

            ("พฤหัสบดี", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU071013": {

        "name": "สิ่งแวดล้อม มลพิษ และพลังงาน ในชีวิตประจำวัน",

        "description": """
        ระบบนิเวศ มลพิษทางน้ำ มลพิษทางอากาศ
        มลพิษทางดิน มูลฝอย
        พลังงานและผลกระทบต่อภาวะภูมิอากาศของโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU313": {

        "name": "ธรรมชาติวิจักษ์",

        "description": """
        ความหลากหลายทางชีวภาพ
        ความสำคัญและบทบาทของสิ่งมีชีวิต
        คุณค่าและความงามของธรรมชาติ
        การสร้างจิตสำนึกในการอนุรักษ์และความรับผิดชอบต่อสังคม
        """,

        "classes": [

            ("พฤหัสบดี", "16:40", "19:20")

        ],

        "midterm": None,

        "final": None

    },

    "SU073002": {

        "name": "รักษ์นก",

        "description": """
        การดูนก การจำแนกชนิด
        ถิ่นที่อยู่อาศัย พฤติกรรมการร้อง
        การหาอาหารและการสืบพันธุ์
        พฤติกรรมการสร้างรัง
        การอพยพ การอนุรักษ์
        """,

        "classes": [

            ("อังคาร", "15:45", "18:25")

        ],

        "midterm": None,

        "final": None

    },
    "SU314": {

        "name": "รักษ์นก",

        "description": """
        การดูนก การจำแนกชนิด
        ถิ่นที่อยู่อาศัย พฤติกรรมการร้อง
        การหาอาหารและการสืบพันธุ์
        พฤติกรรมการสร้างรัง
        การอพยพ การอนุรักษ์
        """,

        "classes": [

            ("อังคาร", "15:45", "18:25")

        ],

        "midterm": None,

        "final": None

    },

    "SU315": {

        "name": "การอนุรักษ์สิ่งแวดล้อมธรรมชาติและศิลปกรรม",

        "description": """
        ความรู้พื้นฐานด้านสิ่งแวดล้อมและทรัพยากรธรรมชาติ
        ปัญหาด้านสิ่งแวดล้อม ผลกระทบของภัยคุกคามทางกายภาพ
        เคมี และชีวภาพต่อศิลปกรรม บริการของระบบนิเวศและการท่องเที่ยวเชิงนิเวศ
        หลักการพื้นฐานในการอนุรักษ์สิ่งแวดล้อมทางธรรมชาติและศิลปกรรม
        การประยุกต์ความรู้ด้านวิทยาศาสตร์ในการอนุรักษ์สิ่งแวดล้อมธรรมชาติ
        ศิลปกรรม และมรดกโลก
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU316": {

        "name": "โลกของจุลินทรีย์",

        "description": """
        ประโยชน์และความสำคัญของจุลินทรีย์ต่อวงการอาหาร
        อุตสาหกรรมการเกษตรและการแพทย์ต่อมนุษย์ในชีวิตประจำวัน
        การใช้จุลินทรีย์โดยคำนึงถึงความปลอดภัยของผู้บริโภคและสิ่งแวดล้อม
        """,

        "classes": [

            ("อังคาร", "16:40", "19:20")

        ],

        "midterm": None,

        "final": None

    },

    "SU318": {

        "name": "สิ่งแวดล้อม มลพิษและพลังงาน",

        "description": """
        ระบบนิเวศ มลพิษทางน้ำ
        มลพิษทางอากาศ มลพิษทางดิน
        มูลฝอย พลังงานและผลกระทบต่อภาวะภูมิอากาศของโลก
        เก็บ A ง่าย
        เรียนสบาย นอนเรียน
        เรียนออนไลน์
        """,

        "classes": [

            ("พุธ", "13:00", "15:40")

        ],

        "midterm": None,

        "final": None

    },

    "SU071007": {

        "name": "การเพาะเห็ดและการต่อยอดทางธุรกิจ",

        "description": """
        เทคโนโลยีการเพาะเห็ด การเพาะเห็ดกับการท่องเที่ยวเชิงนิเวศ
        การพัฒนาผลิตภัณฑ์อาหารและอาหารเสริมสุขภาพจากเห็ด
        หลักการของกฎระเบียบและมาตรฐานการเกษตร
        การท่องเที่ยวและการผลิตอาหาร
        เก็บ A ง่าย
        เรียนสบาย
        """,

        "classes": [

            ("อังคาร", "16:40", "19:20")

        ],

        "midterm": None,

        "final": None

    },
    "SU411": {

        "name": "การเพาะเห็ดและการต่อยอดทางธุรกิจ",

        "description": """
        เทคโนโลยีการเพาะเห็ด การเพาะเห็ดกับการท่องเที่ยวเชิงนิเวศ
        การพัฒนาผลิตภัณฑ์อาหารและอาหารเสริมสุขภาพจากเห็ด
        หลักการของกฎระเบียบและมาตรฐานการเกษตร
        การท่องเที่ยวและการผลิตอาหาร
        เก็บ A ง่าย
        เรียนสบาย
        """,

        "classes": [

            ("อังคาร", "16:40", "19:20")

        ],

        "midterm": None,

        "final": None

    },


        "511103": {

        "name": "แคลคูลัสสำหรับนักวิทยาศาสตร์ชีวภาพ",

        "description": """
        เมทริกซ์และการแก้ระบบสมการเชิงเส้น
        สมบัติทางพีชคณิตและเรขาคณิตของเวกเตอร์
        ความสัมพันธ์และฟังก์ชัน ฟังก์ชันอดิศัย
        อัตราการเปลี่ยนแปลง อนุพันธ์ ปริพันธ์
        พื้นที่ระหว่างเส้นโค้ง อนุกรมเทย์เลอร์
        อนุกรมแมคคลอริน สมการเชิงอนุพันธ์อันดับหนึ่ง
        แบบแยกตัวแปรได้และการประยุกต์
        """,

       "classes": [
            ("จันทร์", "13:00", "14:45"),
            ("ศุกร์", "10:20", "12:05")
            ],

        "midterm": (
                "2569-01-27",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-23",
                "09:00",
                "12:00"
            )
        },


        
    "511104": {

        "name": "แคลคูลัสสำหรับวิศวกร 1",

        "description": """
        ลิมิตและความต่อเนื่อง การหาอนุพันธ์และการประยุกต์
        ในทางวิศวกรรมศาสตร์ ค่าสุดขีดของฟังก์ชัน
        รูปแบบยังไม่กำหนด กฎของโลปิตาล
        ลำดับและอนุกรมอนันต์ อนุกรมกำลัง
        อนุกรมเทย์เลอร์และอนุกรมแมคคลอริน
        """,

       "classes": [
            ("อังคาร", "10:20", "12:05"),
            ("พฤหัสบดี", "13:55", "15:40")
            ],

        "midterm": (
                "2569-01-28",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-25",
                "09:00",
                "12:00"
            )
        },


    "511105": {

        "name": "แคลคูลัสสำหรับวิศวกรวัสดุ",

        "description": """
        ลิมิตและความต่อเนื่อง การหาอนุพันธ์และการประยุกต์
        ในทางวิศวกรรมศาสตร์ การหาปริพันธ์ของฟังก์ชันค่าจริง
        เทคนิคการหาปริพันธ์ การประยุกต์การหาปริพันธ์
        ในทางวิศวกรรมศาสตร์ สมการเชิงอนุพันธ์เบื้องต้น
        และการประยุกต์ในทางวิศวกรรมศาสตร์
        และพิกัดเชิงขั้ว
        """,
        "classes": [
            ("จันทร์", "15:45", "16:35"),
            ("ศุกร์", "08:30", "11:10")
            ],

        "midterm": (
                "2569-01-28",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-01-25",
                "09:00",
                "12:00"
            )

    },


    "511110": {

        "name": "แคลคูลัสสำหรับการวิเคราะห์ข้อมูล 1",

        "description": """
        ลิมิตและความต่อเนื่อง อนุพันธ์และการประยุกต์
        ปริพันธ์ไม่จำกัดเขตและปริพันธ์จำกัดเขตและการประยุกต์
        การหาอนุพันธ์และการหาปริพันธ์ของฟังก์ชันอดิศัย
        ปริพันธ์ไม่ตรงแบบ ลำดับและอนุกรมอนันต์
        อนุกรมกำลัง อนุกรมเทย์เลอร์และอนุกรมแมคคลอริน
        """,

        "classes": [
            ("จันทร์", "08:30", "10:15"),
            ("พฤหัสบดี", "10:20", "12:05")
            ],

        "midterm": (
                "2569-01-25",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-17",
                "09:00",
                "12:00"
            )


    },
    "514107": {

        "name": "ฟิสิกส์พื้นฐาน",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        การสั่นและคลื่น อุณหพลศาสตร์
        กลศาสตร์ของไหล เสียง สนามไฟฟ้า
        สนามแม่เหล็ก ทัศนศาสตร์ ฟิสิกส์ยุคใหม่
        """,

        "classes": [
            ("พุธ", "13:00", "14:45"),
            ("ศุกร์", "13:00", "14:45")
            ],

        "midterm": (
                "2569-02-01",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-24",
                "13:30",
                "16:30"
            )

    },


    "514108": {

        "name": "ปฏิบัติการฟิสิกส์พื้นฐาน",

        "description": """
        การทดลองที่สอดคล้องกับเนื้อหา
        ในรายวิชา 514107 ฟิสิกส์พื้นฐาน
        """,

        "classes": [
            ("จันทร์", "13:00", "15:40")
            ],

        "midterm": None ,

        "final": (
                "2569-03-26",
                "09:00",
                "11:00"
            )

    },


    "514109": {

        "name": "ฟิสิกส์ทั่วไปสำหรับนักศึกษาเภสัชศาสตร์",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        สมบัติของสสาร กลศาสตร์ของของไหล
        ทฤษฎีจลน์ของแก๊ส เทอร์โมไดนามิกส์
        การสั่นและคลื่น เสียง สนามไฟฟ้า
        สนามแม่เหล็ก ทัศนศาสตร์ ฟิสิกส์ยุคใหม่
        """,

        "classes": [
            ("พุธ", "10:20", "12:05"),
            ("ศุกร์", "08:30", "10:15")
            ],

        "midterm": (
                "2569-01-24",
                "09:00",
                "12:00"
            ),

        "final": (
                "2569-03-24",
                "13:30",
                "16:30"
            )

    },


    "514110": {

        "name": "ฟิสิกส์ทั่วไปสำหรับวิศวกรวัสดุ",

        "description": """
        กลศาสตร์ของอนุภาคและวัตถุเกร็ง
        สมบัติของสสาร กลศาสตร์ของของไหล
        ทฤษฎีจลน์ของแก๊ส การสั่นและคลื่น
        เสียง ควอนตัมฟิสิกส์
        """,

        "classes": [
            ("จันทร์", "13:00", "13:50"),
            ("พุธ", "08:30", "10:15")
            ],

        "midterm": (
                "2569-01-31",
                "13:00",
                "16:00"
            ) ,

        "final": (
                "2569-03-25",
                "13:30",
                "16:30"
            )

    },


    "514231": {

        "name": "ข้อมูลฟิสิกส์สำหรับนักวิทยาศาสตร์",

        "description": """
        ปริมาณทางกายภาพและระบบหน่วย
        วิธีรวบรวมข้อมูลทางกายภาพ
        การวิเคราะห์และแปลความหมายข้อมูลทางกายภาพ
        การนำเสนอ การจัดการข้อมูล
        """,

        "classes": [
            ("จันทร์", "13:00", "14:45"),
            ("พฤหัสบดี", "14:50", "16:35")
            ],

        "midterm": (
                "2569-01-27",
                "13:00",
                "16:00"
            ) ,

        "final": (
                "2569-03-31",
                "09:00",
                "12:00"
            )

    },
        "515100": {

        "name": "การจัดการสารสนเทศทางสถิติเบื้องต้น",

        "description": """
        ประเภทของข้อมูล การจัดเตรียมข้อมูล
        การจัดการข้อมูลสูญหาย สถิติพรรณนา
        การวิเคราะห์และการนำเสนอข้อมูล
        กราฟ แผนภาพและตาราง
        สารสนเทศทางสถิติจากกราฟและตาราง
        การใช้โปรแกรมสำเร็จรูป
        การรายงานและการนำเสนอผลงาน
        """,

        "classes": [
            ("พฤหัสบดี", "08:30", "12:05")
            ],

        "midterm": (
                "2569-01-29",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2569-03-27",
                "09:00",
                "12:00"
            )
        },
        "515104": {

        "name": "สถิติสำหรับคอมพิวเตอร์",

        "description": """
        ความหมายและประเภทของสถิติ การเก็บรวบรวมข้อมูล
        ข้อมูลและระดับการวัด สถิติพรรณนา
        การนำเสนอข้อมูล ความน่าจะเป็น
        ตัวแปรสุ่มและการแจกแจงความน่าจะเป็น
        การแจกแจงทวินาม ปัวซอง ปกติ
        และการแจกแจงแบบเลขชี้กำลัง
        การแจกแจงค่าตัวอย่าง
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐาน สถิติไม่อิงพารามิเตอร์
        การถดถอยอย่างง่ายและสหสัมพันธ์
        การวิเคราะห์ความแปรปรวน
        การประยุกต์สถิติเพื่อประมวลผลข้อมูล
        และการใช้ภาษาโปรแกรมในการวิเคราะห์
        """,

        "classes": [
            ("จันทร์", "14:50", "16:35"),
            ("อังคาร", "13:00", "14:45")
            ],

        "midterm": (
                "2569-01-27",
                "13:00",
                "16:00"
            ) ,

        "final": (
                "2569-03-24",
                "09:00",
                "15:30"
            )


    },


    "515201": {

        "name": "สถิติพื้นฐาน",

        "description": """
        ธรรมชาติของสถิติและแนวทางการประยุกต์โดยทั่วไป
        สถิติพรรณนาและความน่าจะเป็น
        การแจกแจงความน่าจะเป็นของตัวแปรสุ่ม
        การเลือกตัวอย่างและการแจกแจงค่าตัวอย่าง
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐาน การวิเคราะห์ความแปรปรวน
        การทดสอบไคกำลังสอง สถิติไม่อิงพารามิเตอร์
        การถดถอยอย่างง่ายและสหสัมพันธ์
        การใช้ภาษาโปรแกรมหรือโปรแกรมสำเร็จรูปในการวิเคราะห์
        """,

        "classes": [
            ("พุธ", "10:20", "12:05"),
            ("ศุกร์", "10:20", "12:05")
            ],

        "midterm": (
                "2569-09-06",
                "09:00",
                "12:00"
            ) ,

        "final": (
                "2569-10-30",
                "09:00",
                "16:30"
            )


    },


    "515203": {

        "name": "สถิติสำหรับนักวิทยาศาสตร์ชีวภาพ 1",

        "description": """
        ความหมายและประเภทของสถิติ ประเภทของข้อมูล
        สถิติพรรณนา การนำเสนอข้อมูล
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐานทางสถิติเกี่ยวกับค่าเฉลี่ย
        และความแปรปรวนสำหรับหนึ่งประชากร
        สองประชากรและหลายประชากร
        สถิติที่ไม่อิงพารามิเตอร์
        การตรวจสอบการแจกแจงปรกติ การแปลงข้อมูล
        การวิเคราะห์สหสัมพันธ์และการถดถอยอย่างง่าย
        การวิเคราะห์ความเกี่ยวพันสำหรับตัวแปรจำแนกประเภท
        การใช้โปรแกรมสำเร็จรูปในการวิเคราะห์และแปลผล
        """,

        "classes": [
            ("จันทร์", "13:55", "15:40"),
            ("พฤหัสบดี", "13:00", "14:45")
            ],

        "midterm": (
                "2569-01-26",
                "09:00",
                "15:00"
            ) ,

        "final": (
                "2569-10-28",
                "09:00",
                "15:30"
            )

    },


    "515206": {

        "name": "สถิติพื้นฐานสำหรับนักเคมี",

        "description": """
        สถิติพื้นฐานและการประยุกต์ทางเคมี
        การประมาณค่าพารามิเตอร์และช่วงความเชื่อมั่น
        การทดสอบสมมติฐานทางสถิติเกี่ยวกับค่าเฉลี่ย
        และความแปรปรวนสำหรับหนึ่งประชากร
        สองประชากรและหลายประชากร
        สถิติที่ไม่ใช้พารามิเตอร์
        การวิเคราะห์สหสัมพันธ์และการถดถอยอย่างง่าย
        การใช้โปรแกรมสำเร็จรูปในการวิเคราะห์และแปลผล
        """,

        "classes": [
            ("อังคาร", "11:15", "12:05"),
            ("พุธ", "13:00", "14:45")
            ],

        "midterm": (
                "2569-01-31",
                "13:00",
                "16:00"
            ) ,

        "final": (
                "2569-03-28",
                "13:00",
                "16:00"
            )

    },
        "517111": {

        "name": "การเขียนโปรแกรมคอมพิวเตอร์สำหรับนักวิทยาการข้อมูล",

        "description": """
        ขั้นตอนการแก้ปัญหา ผังงาน
        การเขียนโปรแกรมเบื้องต้น ชนิดของข้อมูล
        การประมวลผลข้อมูล
        ฟังก์ชันและไลบรารี่มาตรฐาน
        """,

        "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("พุธ", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"

                )


    },
        "517111": {

        "name": "การเขียนโปรแกรมคอมพิวเตอร์สำหรับนักวิทยาการข้อมูล",

        "description": """
        ขั้นตอนการแก้ปัญหา ผังงาน
        การเขียนโปรแกรมเบื้องต้น ชนิดของข้อมูล
        การประมวลผลข้อมูล
        ฟังก์ชันและไลบรารี่มาตรฐาน
        """,

        "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("พฤหัสบดี", "14:50", "16:35")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"
                )

    },
        "517111": {

        "name": "การเขียนโปรแกรมคอมพิวเตอร์สำหรับนักวิทยาการข้อมูล",

        "description": """
        ขั้นตอนการแก้ปัญหา ผังงาน
        การเขียนโปรแกรมเบื้องต้น ชนิดของข้อมูล
        การประมวลผลข้อมูล
        ฟังก์ชันและไลบรารี่มาตรฐาน
        """,

        "classes": [
                    ("จันทร์", "16:40", "18:25"),
                    ("พุธ", "10:20", "12:05"),
                    ("ศุกร์", "08:30", "10:15")
                ],

                "midterm": (
                    "2569-01-31",
                    "09:00",
                    "17:00"
                ),
                "final": (
                    "2569-03-27",
                    "09:00",
                    "17:00"
                )

    }

}
}


# ============================================================

# 3. ประวัติการลงทะเบียนสำหรับ Item-Based CF

# ============================================================

ENROLLMENT_DATA = [

    ("คณิตศาสตร์", "SU071013", 76),
    ("คณิตศาสตร์", "SU071013", 71),
    ("คณิตศาสตร์", "SU313", 11),
    ("คณิตศาสตร์", "SU411", 43),
    ("คณิตศาสตร์", "SU314", 74),
    ("คณิตศาสตร์", "SU314", 67),
    ("คณิตศาสตร์", "SU132", 12),
    ("คณิตศาสตร์", "SU318", 43),
    ("คณิตศาสตร์", "SU134", 74),
    ("คณิตศาสตร์", "SU134", 67),
    ("คณิตศาสตร์", "SU313", 12),
    ("คณิตศาสตร์", "SU134", 43),
    ("คณิตศาสตร์", "SU314", 74),
    ("คณิตศาสตร์", "514107", 66),
    ("คณิตศาสตร์", "SU132", 12),
    ("คณิตศาสตร์", "SU411", 43),
    ("คณิตศาสตร์", "SU071007", 74),
    ("คณิตศาสตร์", "SU313", 66),
    ("คณิตศาสตร์", "SU134", 12),
    ("คณิตศาสตร์", "SU411", 43),
    ("คณิตศาสตร์", "SU140", 58),
    ("คณิตศาสตร์", "511102", 53),
    ("คณิตศาสตร์", "SU132", 29),
    ("คณิตศาสตร์", "SU314", 28),
    ("คณิตศาสตร์", "SU318", 67),
    ("คณิตศาสตร์", "SU313", 61),
    ("คณิตศาสตร์", "SU140", 58),
    ("คณิตศาสตร์", "513101", 40),
    ("คณิตศาสตร์", "513103", 60),
    ("คณิตศาสตร์", "SU140", 58),
    ("คณิตศาสตร์", "SU071007", 48),
    ("คณิตศาสตร์", "SU314", 40),
    ("คณิตศาสตร์", "SU411", 69),
    ("คณิตศาสตร์", "SU140", 58),
    ("คณิตศาสตร์", "517111", 42),
    ("คณิตศาสตร์", "517111", 41),
    ("ชีววิทยา", "SU134", 124),
    ("ชีววิทยา", "511106", 33),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "SU140", 111),
    ("ชีววิทยา", "SU313", 92),
    ("ชีววิทยา", "SU134", 111),
    ("ชีววิทยา", "SU132", 6),
    ("ชีววิทยา", "SU318", 111),
    ("ชีววิทยา", "SU411", 122),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "SU071013", 7),
    ("ชีววิทยา", "SU411", 127),
    ("ชีววิทยา", "513101", 28),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "513101", 13),
    ("ชีววิทยา", "SU313", 15),
    ("ชีววิทยา", "513103", 122),
    ("ชีววิทยา", "SU411", 111),
    ("ชีววิทยา", "SU071013", 6),
    ("ชีววิทยา", "SU411", 111),
    ("ชีววิทยา", "SU411", 122),
    ("ชีววิทยา", "514107", 119),
    ("ชีววิทยา", "SU411", 6),
    ("ชีววิทยา", "514107", 111),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "SU132", 80),
    ("ชีววิทยา", "SU314", 6),
    ("ชีววิทยา", "SU411", 111),
    ("ชีววิทยา", "SU071013", 90),
    ("ชีววิทยา", "SU140", 111),
    ("ชีววิทยา", "511107", 91),
    ("ชีววิทยา", "SU313", 89),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "512103", 103),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "SU140", 111),
    ("ชีววิทยา", "SU313", 111),
    ("ชีววิทยา", "512104", 103),
    ("ชีววิทยา", "SU071013", 81),
    ("ชีววิทยา", "SU318", 100),
    ("ชีววิทยา", "SU314", 70),
    ("ชีววิทยา", "SU139", 81),
    ("ชีววิทยา", "SU313", 91),
    ("ชีววิทยา", "SU411", 81),
    ("ชีววิทยา", "SU132", 70),
    ("ชีววิทยา", "SU071013", 86),
    ("ชีววิทยา", "513104", 91),
    ("ชีววิทยา", "SU071007", 81),
    ("ชีววิทยา", "SU140", 111),
    ("ชีววิทยา", "SU134", 81),
    ("เคมี", "SU071013", 82),
    ("เคมี", "SU313", 93),
    ("เคมี", "SU132", 0),
    ("เคมี", "SU134", 104),
    ("เคมี", "SU071013", 102),
    ("เคมี", "SU140", 91),
    ("เคมี", "SU314", 0),
    ("เคมี", "SU139", 102),
    ("เคมี", "512102", 81),
    ("เคมี", "SU411", 90),
    ("เคมี", "SU313", 0),
    ("เคมี", "512102", 103),
    ("เคมี", "513101", 5),
    ("เคมี", "SU132", 5),
    ("เคมี", "SU411", 3),
    ("เคมี", "SU313", 9),
    ("เคมี", "SU134", 81),
    ("เคมี", "SU071007", 91),
    ("เคมี", "513103", 0),
    ("เคมี", "SU134", 104),
    ("เคมี", "513161", 81),
    ("เคมี", "SU313", 91),
    ("เคมี", "SU134", 111),
    ("เคมี", "SU139", 102),
    ("เคมี", "SU314", 65),
    ("เคมี", "SU134", 93),
    ("เคมี", "511102", 65),
    ("เคมี", "511102", 80),
    ("เคมี", "SU313", 67),
    ("เคมี", "513102", 80),
    ("เคมี", "SU139", 102),
    ("เคมี", "SU411", 82),
    ("เคมี", "SU132", 67),
    ("เคมี", "513104", 79),
    ("เคมี", "SU139", 102),
    ("เคมี", "SU313", 82),
    ("เคมี", "SU139", 102),
    ("เคมี", "SU134", 80),
    ("เคมี", "SU071007", 102),
    ("เคมี", "SU411", 82),
    ("เคมี", "SU071007", 102),
    ("เคมี", "SU318", 79),
    ("เคมี", "SU139", 102),
    ("เคมี", "514108", 82),
    ("ฟิสิกส์", "511101", 41),
    ("ฟิสิกส์", "SU132", 29),
    ("ฟิสิกส์", "SU315", 3),
    ("ฟิสิกส์", "SU313", 12),
    ("ฟิสิกส์", "SU139", 35),
    ("ฟิสิกส์", "SU411", 27),
    ("ฟิสิกส์", "SU139", 35),
    ("ฟิสิกส์", "512101", 12),
    ("ฟิสิกส์", "SU071013", 35),
    ("ฟิสิกส์", "SU139", 35),
    ("ฟิสิกส์", "512102", 3),
    ("ฟิสิกส์", "SU315", 12),
    ("ฟิสิกส์", "SU313", 11),
    ("ฟิสิกส์", "SU132", 2),
    ("ฟิสิกส์", "SU134", 35),
    ("ฟิสิกส์", "SU139", 35),
    ("ฟิสิกส์", "513103", 3),
    ("ฟิสิกส์", "SU140", 12),
    ("ฟิสิกส์", "514101", 5),
    ("ฟิสิกส์", "SU313", 3),
    ("ฟิสิกส์", "SU139", 22),
    ("ฟิสิกส์", "514103", 27),
    ("ฟิสิกส์", "SU315", 22),
    ("ฟิสิกส์", "511102", 19),
    ("ฟิสิกส์", "511102", 7),
    ("ฟิสิกส์", "511102", 6),
    ("ฟิสิกส์", "SU134", 19),
    ("ฟิสิกส์", "SU318", 20),
    ("ฟิสิกส์", "513102", 5),
    ("ฟิสิกส์", "SU318", 0),
    ("ฟิสิกส์", "SU411", 19),
    ("ฟิสิกส์", "SU134", 20),
    ("ฟิสิกส์", "513104", 9),
    ("ฟิสิกส์", "SU139", 22),
    ("ฟิสิกส์", "513104", 3),
    ("ฟิสิกส์", "SU313", 12),
    ("ฟิสิกส์", "SU071013", 3),
    ("ฟิสิกส์", "SU315", 12),
    ("ฟิสิกส์", "SU139", 22),
    ("ฟิสิกส์", "SU411", 24),
    ("ฟิสิกส์", "SU139", 8),
    ("ฟิสิกส์", "514102", 13),
    ("ฟิสิกส์", "514104", 22),
    ("ฟิสิกส์", "SU140", 23),
    ("ฟิสิกส์", "SU134", 8),
    ("ฟิสิกส์", "514104", 13),
    ("ฟิสิกส์", "SU318", 22),
    ("ฟิสิกส์", "514161", 29),
    ("ฟิสิกส์", "SU194", 9),
    ("ฟิสิกส์", "514161", 13),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU134", 94),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "511110", 77),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU411", 11),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU071013", 30),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU071013", 84),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU134", 75),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU139", 51),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU140", 30),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU139", 51),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU134", 58),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "515101", 30),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU315", 109),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU316", 55),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU139", 51),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "511111", 16),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU194", 80),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU139", 51),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU411", 53),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU316", 26),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "517111", 83),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "SU134", 70),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "517111", 53),
    ("สถิติและวิทยาการวิเคราะห์ข้อมูล", "517111", 26),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "511106", 90),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "511106", 68),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU132", 8),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU194", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "512101", 78),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU316", 65),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "512101", 7),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "512101", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU194", 0),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU134", 59),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU411", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513101", 36),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU140", 14),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513101", 11),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU411", 35),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513103", 78),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU134", 64),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU071007", 7),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU139", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU139", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "511107", 68),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU139", 77),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "511107", 45),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU316", 68),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU411", 56),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU140", 64),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "512104", 62),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513102", 42),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513102", 35),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU140", 41),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513102", 32),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU194", 42),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513104", 35),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "SU071007", 41),
    ("วิทยาศาสตร์สิ่งแวดล้อม", "513104", 32),
    ("วิทยาการคอมพิวเตอร์", "511100", 32),
    ("วิทยาการคอมพิวเตอร์", "SU134", 51),
    ("วิทยาการคอมพิวเตอร์", "511100", 59),
    ("วิทยาการคอมพิวเตอร์", "511100", 131),
    ("วิทยาการคอมพิวเตอร์", "SU194", 48),
    ("วิทยาการคอมพิวเตอร์", "SU073002", 58),
    ("วิทยาการคอมพิวเตอร์", "SU140", 85),
    ("วิทยาการคอมพิวเตอร์", "511108", 69),
    ("วิทยาการคอมพิวเตอร์", "517101", 75),
    ("วิทยาการคอมพิวเตอร์", "SU316", 85),
    ("วิทยาการคอมพิวเตอร์", "SU134", 131),
    ("วิทยาการคอมพิวเตอร์", "517101", 95),
    ("วิทยาการคอมพิวเตอร์", "SU071007", 75),
    ("วิทยาการคอมพิวเตอร์", "517121", 85),
    ("วิทยาการคอมพิวเตอร์", "SU139", 98),
    ("วิทยาการคอมพิวเตอร์", "517121", 110),
    ("วิทยาการคอมพิวเตอร์", "SU194", 85),
    ("วิทยาการคอมพิวเตอร์", "515104", 86),
    ("วิทยาการคอมพิวเตอร์", "SU411", 119),
    ("วิทยาการคอมพิวเตอร์", "515104", 89),
    ("วิทยาการคอมพิวเตอร์", "517112", 84),
    ("วิทยาการคอมพิวเตอร์", "SU139", 84),
    ("วิทยาการคอมพิวเตอร์", "517112", 43),
    ("วิทยาการคอมพิวเตอร์", "SU073002", 88),
    ("วิทยาการคอมพิวเตอร์", "SU140", 73),
    ("วิทยาการคอมพิวเตอร์", "517122", 82),
    ("วิทยาการคอมพิวเตอร์", "SU134", 72),
    ("วิทยาการคอมพิวเตอร์", "SU071007", 90),
    ("จุลชีววิทยา", "SU194", 121),
    ("จุลชีววิทยา", "SU139", 103),
    ("จุลชีววิทยา", "511114", 7),
    ("จุลชีววิทยา", "511114", 127),
    ("จุลชีววิทยา", "SU134", 111),
    ("จุลชีววิทยา", "512101", 102),
    ("จุลชีววิทยา", "SU194", 7),
    ("จุลชีววิทยา", "512101", 127),
    ("จุลชีววิทยา", "SU140", 114),
    ("จุลชีววิทยา", "512102", 102),
    ("จุลชีววิทยา", "512102", 7),
    ("จุลชีววิทยา", "SU134", 127),
    ("จุลชีววิทยา", "SU139", 14),
    ("จุลชีววิทยา", "SU071013", 12),
    ("จุลชีววิทยา", "SU318", 13),
    ("จุลชีววิทยา", "SU140", 17),
    ("จุลชีววิทยา", "SU194", 114),
    ("จุลชีววิทยา", "SU318", 102),
    ("จุลชีววิทยา", "SU071007", 7),
    ("จุลชีววิทยา", "513103", 127),
    ("จุลชีววิทยา", "SU139", 97),
    ("จุลชีววิทยา", "513102", 89),
    ("จุลชีววิทยา", "SU194", 91),
    ("จุลชีววิทยา", "SU318", 102),
    ("จุลชีววิทยา", "SU146", 97),
    ("จุลชีววิทยา", "513104", 89),
    ("จุลชีววิทยา", "SU411", 91),
    ("จุลชีววิทยา", "513104", 102),
    ("จุลชีววิทยา", "SU139", 122),
    ("จุลชีววิทยา", "SU071007", 119),
    ("จุลชีววิทยา", "514107", 96),
    ("จุลชีววิทยา", "514107", 104),
    ("จุลชีววิทยา", "SU073002", 97),
    ("จุลชีววิทยา", "SU140", 89),
    ("จุลชีววิทยา", "SU073002", 96),
    ("จุลชีววิทยา", "SU318", 104),
    ("จุลชีววิทยา", "518101", 95),
    ("จุลชีววิทยา", "SU134", 110),
    ("จุลชีววิทยา", "SU071013", 121),
    ("จุลชีววิทยา", "SU146", 108),
    ("จุลชีววิทยา", "SU071007", 95),
    ("จุลชีววิทยา", "SU134", 110),
    ("จุลชีววิทยา", "SU318", 121),
    ("จุลชีววิทยา", "518102", 108),
    ("คณิตศาสตร์ประยุกต์", "511101", 49),
    ("คณิตศาสตร์ประยุกต์", "SU139", 43),
    ("คณิตศาสตร์ประยุกต์", "511101", 7),
    ("คณิตศาสตร์ประยุกต์", "SU140", 10),
    ("คณิตศาสตร์ประยุกต์", "SU071013", 47),
    ("คณิตศาสตร์ประยุกต์", "512108", 40),
    ("คณิตศาสตร์ประยุกต์", "SU132", 7),
    ("คณิตศาสตร์ประยุกต์", "512108", 10),
    ("คณิตศาสตร์ประยุกต์", "SU318", 47),
    ("คณิตศาสตร์ประยุกต์", "SU071007", 41),
    ("คณิตศาสตร์ประยุกต์", "SU318", 23),
    ("คณิตศาสตร์ประยุกต์", "519161", 10),
    ("คณิตศาสตร์ประยุกต์", "SU139", 24),
    ("คณิตศาสตร์ประยุกต์", "511102", 35),
    ("คณิตศาสตร์ประยุกต์", "SU134", 8),
    ("คณิตศาสตร์ประยุกต์", "511102", 7),
    ("คณิตศาสตร์ประยุกต์", "SU318", 41),
    ("คณิตศาสตร์ประยุกต์", "514231", 34),
    ("คณิตศาสตร์ประยุกต์", "SU134", 21),
    ("คณิตศาสตร์ประยุกต์", "SU134", 10),
    ("คณิตศาสตร์ประยุกต์", "515202", 43),
    ("คณิตศาสตร์ประยุกต์", "SU071007", 41),
    ("คณิตศาสตร์ประยุกต์", "515202", 20),
    ("คณิตศาสตร์ประยุกต์", "SU146", 10),
    ("คณิตศาสตร์ประยุกต์", "517111", 53),
    ("คณิตศาสตร์ประยุกต์", "517111", 39),
    ("คณิตศาสตร์ประยุกต์", "517111", 9),
    ("คณิตศาสตร์ประยุกต์", "SU071003", 9),
    ("เทคโนโลยีสารสนเทศ", "511100", 91),
    ("เทคโนโลยีสารสนเทศ", "SU071007", 95),
    ("เทคโนโลยีสารสนเทศ", "511100", 115),
    ("เทคโนโลยีสารสนเทศ", "511100", 123),
    ("เทคโนโลยีสารสนเทศ", "SU134", 91),
    ("เทคโนโลยีสารสนเทศ", "SU071013", 95),
    ("เทคโนโลยีสารสนเทศ", "SU071003", 115),
    ("เทคโนโลยีสารสนเทศ", "SU134", 123),
    ("เทคโนโลยีสารสนเทศ", "SU139", 103),
    ("เทคโนโลยีสารสนเทศ", "517121", 79),
    ("เทคโนโลยีสารสนเทศ", "SU146", 101),
    ("เทคโนโลยีสารสนเทศ", "SU411", 109),
    ("เทคโนโลยีสารสนเทศ", "520101", 103),
    ("เทคโนโลยีสารสนเทศ", "SU139", 79),
    ("เทคโนโลยีสารสนเทศ", "520101", 101),
    ("เทคโนโลยีสารสนเทศ", "SU318", 109),
    ("เทคโนโลยีสารสนเทศ", "SU134", 80),
    ("เทคโนโลยีสารสนเทศ", "SU146", 80),
    ("เทคโนโลยีสารสนเทศ", "SU134", 49),
    ("เทคโนโลยีสารสนเทศ", "517122", 47),
    ("เทคโนโลยีสารสนเทศ", "520111", 80),
    ("เทคโนโลยีสารสนเทศ", "520111", 80),
    ("เทคโนโลยีสารสนเทศ", "SU139", 49),
    ("เทคโนโลยีสารสนเทศ", "SU071013", 47),
    ("เทคโนโลยีสารสนเทศ", "520112", 80),
    ("เทคโนโลยีสารสนเทศ", "SU139", 80),
    ("เทคโนโลยีสารสนเทศ", "520112", 49),
    ("เทคโนโลยีสารสนเทศ", "520112", 47),
    ("วิทยาการข้อมูล", "511110", 66),
    ("วิทยาการข้อมูล", "SU134", 64),
    ("วิทยาการข้อมูล", "511110", 6),
    ("วิทยาการข้อมูล", "511110", 58),
    ("วิทยาการข้อมูล", "SU071001", 68),
    ("วิทยาการข้อมูล", "SU139", 54),
    ("วิทยาการข้อมูล", "515104", 57),
    ("วิทยาการข้อมูล", "SU318", 41),
    ("วิทยาการข้อมูล", "517111", 68),
    ("วิทยาการข้อมูล", "517111", 54),
    ("วิทยาการข้อมูล", "SU134", 57),
    ("วิทยาการข้อมูล", "SU134", 41),
    ("วิทยาการข้อมูล", "511111", 68),
    ("วิทยาการข้อมูล", "SU140", 54),
    ("วิทยาการข้อมูล", "SU071003", 57),
    ("วิทยาการข้อมูล", "SU139", 41),
    ("วิทยาการข้อมูล", "SU071001", 68),
    ("วิทยาการข้อมูล", "515271", 54),
    ("วิทยาการข้อมูล", "SU071001", 57),
    ("วิทยาการข้อมูล", "SU134", 41),
    ("วิทยาการข้อมูล", "522151", 68),
    ("วิทยาการข้อมูล", "SU071013", 54),
    ("วิทยาการข้อมูล", "SU318", 57),
    ("วิทยาการข้อมูล", "522151", 41),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 37),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU139", 33),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "511106", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071001", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "512101", 30),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU146", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU318", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU139", 36),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "512102", 33),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "512102", 28),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513101", 9),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513101", 0),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU140", 4),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071001", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 36),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513103", 33),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU139", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071013", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 0),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU146", 1),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "514101", 4),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU318", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "514103", 36),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU318", 33),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071001", 3),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "514103", 29),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU134", 44),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "511107", 30),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU318", 24),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "511107", 44),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU139", 26),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU073002", 28),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU140", 46),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513102", 23),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513104", 26),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071001", 28),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU146", 46),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "513104", 23),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU318", 28),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU132", 36),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU071001", 26),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "518101", 50),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU139", 28),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "518102", 36),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "SU073002", 26),
    ("เคมีประยุกต์และจุลชีววิทยาอุตสาหกรรม", "518102", 50),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU134', 82),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU134', 37),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU139', 50),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', '512101', 37),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU139', 76),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', '512102', 37),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU132', 4),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU073002', 0),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU146', 66),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU411', 37),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU139', 68),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', '513102', 34),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', '513104', 68),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU140', 34),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU071001', 34),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU411', 68),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU134', 66),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU318', 37),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU146', 66),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU411', 68),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU139', 34),
    ('เคมีผลิตภัณฑ์และธุรกิจเครื่องสำอาง', 'SU134', 37)
 ]
 
enrollment = pd.DataFrame(

    ENROLLMENT_DATA,

    columns=[

        "major",
        "course_id",
        "student_count"
    ]

)


# ============================================================

# 4. ฟังก์ชันแปลงเวลา

# ============================================================

def time_to_minutes(time_string):

    hour, minute = map(

        int,

        time_string.split(":")

    )

    return hour * 60 + minute


# ============================================================

# 5. ตรวจสอบเวลาชน

# ============================================================

def time_overlap(

    start1,

    end1,

    start2,

    end2

):

    start1 = time_to_minutes(start1)

    end1 = time_to_minutes(end1)

    start2 = time_to_minutes(start2)

    end2 = time_to_minutes(end2)

    return (

        start1 < end2

        and

        start2 < end1

    )


# ============================================================

# 6. ตรวจสอบตารางเรียนชน

# ============================================================

def class_conflict(

    elective,

    mandatory

):

    for (

        e_day,

        e_start,

        e_end

    ) in elective["classes"]:

        for (

            m_day,

            m_start,

            m_end

        ) in mandatory["classes"]:

            if e_day == m_day:

                if time_overlap(

                    e_start,

                    e_end,

                    m_start,

                    m_end

                ):

                    return True

    return False


# ============================================================

# 7. ตรวจสอบการสอบชน

# ============================================================

def exam_conflict(

    elective_exam,

    mandatory_exam

):

    # กรณีไม่มีสอบ

    if elective_exam is None:

        return False

    if mandatory_exam is None:

        return False


    e_date, e_start, e_end = elective_exam

    m_date, m_start, m_end = mandatory_exam


    # คนละวัน ไม่ชน

    if e_date != m_date:

        return False


    return time_overlap(

        e_start,

        e_end,

        m_start,

        m_end

    )